// ---------------------------------------------------------------------------

#pragma hdrstop

#include "Metadata.h"

// ---------------------------------------------------------------------------

#pragma package(smart_init)

const DBMetadata Mdata;

// ---------------------------------------------------------------------------
DBMetadata::DBMetadata() {

	// Добавление справочников

	AddTable("Клиенты");
	AddId("Код");
	AddColumn("ФИО");

	AddTable("Страны");
	AddId("Код");
	AddColumn("Название");

	AddTable("Туры");
	AddId("Код");
	AddColumn("Назначение");
	AddKey("Страна", "Название", "Страны", "Код");

	AddTable("Путёвки");
	AddId("Код");
	AddKey("Тур", "Назначение", "Туры", "Код");
	AddKey("Клиент", "ФИО", "Клиенты", "Код");
	AddColumn("Цена");

	// Добавление отчетов

	AddReport("Статистика");
	AddColumn("Наименование");
	AddColumn("Количество");

	AddReport("Продажи");
	AddColumn("Дата");
	AddColumn("Продажи");
}
// ---------------------------------------------------------------------------
